create-user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://cyberdiverge.com/users-soap-api">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:createUserRequest>
         <gs:user>
            <gs:id>123456</gs:id>
            <gs:username>dahmad</gs:username>
            <gs:firstname>Daniyal</gs:firstname>
            <gs:lastname>Ahmad</gs:lastname>
            <gs:email>test@test.com</gs:email>
         </gs:user>
      </gs:createUserRequest>
   </soapenv:Body>
</soapenv:Envelope>